ezois_ka/oooezoiskaobmen.ИТБК_/src/DataProcessors/Автоизготовление/Автоизготовление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Автоизготовление</name>
  <attributes>
    <name>ЗаказНаСборку</name>
    <type>
      <types>DocumentRef.ЗаказНаСборку</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСборки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Норма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дополнительно</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исключить</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Доизготовление</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаСкладе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НаСкладеВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВРезерве</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Серия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

ezois_ka/oooezoiskaobmen.ИТБК_/src/DataProcessors/Автоизготовление/Forms/ФормаРедактированияОстатков/Module.bsl
&НаКлиенте
Процедура МатериалыПриИзменении(Элемент)
    
    ТС = Элементы.Материалы.ТекущиеДанные;
    Если тс = Неопределено тогда Возврат КонецЕсли;;
    
    Тс.Количество = ТС.Норма + Тс.Дополнительно - ТС.Исключить ;
    
    //заполним таблицу владельца по нашей    
    КопироватьДанныеФормы(Объект,ВладелецФормы.Объект);
    
    //пересчитаем остатки с учетом изменений
    ВладелецФормы.ПересчитатьОстатки();
    ВладелецФормы.РазвернемДерево();
    
    //обновим данные нашей формы с новыми остатками
    КопироватьДанныеФормы(ВладелецФормы.Объект,Объект);
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    Элементы.Материалы.ОтборСтрок = Новый ФиксированнаяСтруктура("ИДРодителя", Параметры.Родитель) ;
    
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПриАктивизацииЯчейки(Элемент)
    
    Элементы.Материалы.ВыделенныеСтроки.Очистить();
    
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПередУдалением(Элемент, Отказ)
    
    Отказ = Истина;
    
КонецПроцедуры

&НаКлиенте
Процедура МатериалыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
    
    Отказ = Истина;
    
КонецПроцедуры
